# Setup

This is following [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html) for pandas 1.4.3 but may take a little more than 10 minutes to finish. Lot's of small changes, references etc.

You can also open this notebook in Google Colab

<a href="https://colab.research.google.com/github/shauryashaurya/learn-data-munging/blob/main/01.001%20-%2010%2B%20minutes%20to%20pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [29]:
import numpy as np
import pandas as pd

# Object creation

In [30]:
# Series - pass a list to pd.Series
s1 = pd.Series([1, 2, 3, np.nan, 5])

In [31]:
s1

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
dtype: float64

In [32]:
# create an index to use in the dataframe
# default frequency is D (day), so creates a DatetimeIndex of 10 days
dates = pd.date_range('20220619', periods=10)
dates

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

just in case you are wondering, here's [all the "offset aliases"](https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries-offset-aliases) for Datetime

In [33]:
# Dataframe - pass a Numpy array
# create a 10 row, 4 col random number array, index by dates, give some column names
df = pd.DataFrame(np.random.randn(10, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2022-06-19  0.951469  0.509845 -0.462546 -1.213506
2022-06-20 -0.439995  1.077854  1.328994  0.963205
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958
2022-06-22  0.644756 -0.927166 -2.401900  0.737268
2022-06-23 -0.077502 -0.119173  0.810236  1.038025
2022-06-24  0.106912 -2.049418  0.320690  0.549374
2022-06-25 -0.151913  0.425990  1.410461 -2.099694
2022-06-26 -0.737959 -0.217128 -1.357031 -1.084376
2022-06-27  0.862039 -0.209451 -0.068883  0.666439
2022-06-28 -1.324962 -0.528841 -1.014416  0.667417

In [34]:
# Create a dataframe by passing a dictionary of objects
# where each object can be converted into a series-like structure
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220619"),
        "C": pd.Series(1, index=list(range(6)), dtype="float32"),
        "D": np.array([3]*6, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train", "test", "train"]),
        "F": list("foofoo"),
        "G": "foo"
    }
)

df2

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

In [35]:
# the datatype of each of the columns would be different
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G            object
dtype: object

# Viewing Data

In [36]:
# top of the dataframe
df.head()

                   A         B         C         D
2022-06-19  0.951469  0.509845 -0.462546 -1.213506
2022-06-20 -0.439995  1.077854  1.328994  0.963205
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958
2022-06-22  0.644756 -0.927166 -2.401900  0.737268
2022-06-23 -0.077502 -0.119173  0.810236  1.038025

In [37]:
# bottom 3 records of the dataframe
df.tail(3)

                   A         B         C         D
2022-06-26 -0.737959 -0.217128 -1.357031 -1.084376
2022-06-27  0.862039 -0.209451 -0.068883  0.666439
2022-06-28 -1.324962 -0.528841 -1.014416  0.667417

In [38]:
# index of the df
df.index

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

In [39]:
# columns of the df
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [40]:
# .to_numpy gives a NumPy representation of the dataframe
# this is expensive if all columns are of different data type
df.to_numpy()

array([[ 0.95146917,  0.50984502, -0.46254611, -1.21350584],
       [-0.43999545,  1.07785424,  1.32899363,  0.96320468],
       [ 0.10708634, -1.8697014 , -1.47894754, -0.2309576 ],
       [ 0.64475584, -0.92716622, -2.40190036,  0.737268  ],
       [-0.07750214, -0.1191733 ,  0.81023631,  1.03802485],
       [ 0.10691187, -2.04941826,  0.3206904 ,  0.54937395],
       [-0.15191318,  0.42598992,  1.41046083, -2.09969434],
       [-0.73795882, -0.2171277 , -1.3570306 , -1.08437643],
       [ 0.86203869, -0.20945078, -0.06888266,  0.66643926],
       [-1.32496233, -0.52884103, -1.01441608,  0.66741706]])

In [41]:
df2.to_numpy()

array([[1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo']], dtype=object)

In [42]:
# quick summary stats
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.006007  -0.390719  -0.291334  -0.000681
std     0.715654   1.000944   1.278535   1.098016
min    -1.324962  -2.049418  -2.401900  -2.099694
25%    -0.367975  -0.827585  -1.271377  -0.871022
50%     0.014705  -0.213289  -0.265714   0.607907
75%     0.510338   0.289699   0.687850   0.719805
max     0.951469   1.077854   1.410461   1.038025

1. **count** = Count number of non-NA/null observations
1. **max** = Maximum of the values in the object
1. **min** = Minimum of the values in the object
1. **mean** = Mean of the values
1. **std** = Standard deviation of the observations
1. **25%** = Default lower percentile
1. **50%** = 50 percentile - same as the median 
1. **75%** = Default upper percentile

In [43]:
# change the percentiles
df.describe(percentiles=[.1, .5, .9])

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.006007  -0.390719  -0.291334  -0.000681
std     0.715654   1.000944   1.278535   1.098016
min    -1.324962  -2.049418  -2.401900  -2.099694
10%    -0.796659  -1.887673  -1.571243  -1.302125
50%     0.014705  -0.213289  -0.265714   0.607907
90%     0.870982   0.566646   1.337140   0.970687
max     0.951469   1.077854   1.410461   1.038025

In [44]:
# E, F, G in d2 are not numeric, so do not come up in describe()
df2.describe()

         A                    B    C    D
count  6.0                    6  6.0  6.0
mean   1.0  2022-06-19 00:00:00  1.0  3.0
min    1.0  2022-06-19 00:00:00  1.0  3.0
25%    1.0  2022-06-19 00:00:00  1.0  3.0
50%    1.0  2022-06-19 00:00:00  1.0  3.0
75%    1.0  2022-06-19 00:00:00  1.0  3.0
max    1.0  2022-06-19 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [45]:
# transpose the data
# turn rows to columns and vice versa
df.T

,2022-06-19,2022-06-20,2022-06-21,2022-06-22,2022-06-23,2022-06-24,2022-06-25,2022-06-26,2022-06-27,2022-06-28
A,0.951469,-0.439995,0.107086,0.644756,-0.077502,0.106912,-0.151913,-0.737959,0.862039,-1.324962
B,0.509845,1.077854,-1.869701,-0.927166,-0.119173,-2.049418,0.425990,-0.217128,-0.209451,-0.528841
C,-0.462546,1.328994,-1.478948,-2.401900,0.810236,0.320690,1.410461,-1.357031,-0.068883,-1.014416
D,-1.213506,0.963205,-0.230958,0.737268,1.038025,0.549374,-2.099694,-1.084376,0.666439,0.667417

### [Axis in pandas](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.set_axis.html?highlight=set_ax#pandas.DataFrame.set_axis)

```axis{0 or ‘index’, 1 or ‘columns’}```

Always remember that when you specify:
* ```axis=0``` or ```axis='index'``` you indicate that the operation should be along the _index_ (aka across the rows). More often than not indexes will go from top to bottom (vertically), but sometimes they may not (for e.g. if you use columns as index or when you have hierarchical or multi-index data).
* ```axis=1``` or ```axis='columns'``` indicates the operation is along the columns

When in doubt use the explicit version ```'index'``` or ```'columns'``` instead of ```0``` or ```1```

In [46]:
# sort along the axis - 1 = horizontal
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-06-19 -1.213506 -0.462546  0.509845  0.951469
2022-06-20  0.963205  1.328994  1.077854 -0.439995
2022-06-21 -0.230958 -1.478948 -1.869701  0.107086
2022-06-22  0.737268 -2.401900 -0.927166  0.644756
2022-06-23  1.038025  0.810236 -0.119173 -0.077502
2022-06-24  0.549374  0.320690 -2.049418  0.106912
2022-06-25 -2.099694  1.410461  0.425990 -0.151913
2022-06-26 -1.084376 -1.357031 -0.217128 -0.737959
2022-06-27  0.666439 -0.068883 -0.209451  0.862039
2022-06-28  0.667417 -1.014416 -0.528841 -1.324962

In [47]:
# sort along the axis - 0 = vertical
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2022-06-28 -1.324962 -0.528841 -1.014416  0.667417
2022-06-27  0.862039 -0.209451 -0.068883  0.666439
2022-06-26 -0.737959 -0.217128 -1.357031 -1.084376
2022-06-25 -0.151913  0.425990  1.410461 -2.099694
2022-06-24  0.106912 -2.049418  0.320690  0.549374
2022-06-23 -0.077502 -0.119173  0.810236  1.038025
2022-06-22  0.644756 -0.927166 -2.401900  0.737268
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958
2022-06-20 -0.439995  1.077854  1.328994  0.963205
2022-06-19  0.951469  0.509845 -0.462546 -1.213506

In [48]:
# sort ascending by values in a column
df.sort_values(by="A")

                   A         B         C         D
2022-06-28 -1.324962 -0.528841 -1.014416  0.667417
2022-06-26 -0.737959 -0.217128 -1.357031 -1.084376
2022-06-20 -0.439995  1.077854  1.328994  0.963205
2022-06-25 -0.151913  0.425990  1.410461 -2.099694
2022-06-23 -0.077502 -0.119173  0.810236  1.038025
2022-06-24  0.106912 -2.049418  0.320690  0.549374
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958
2022-06-22  0.644756 -0.927166 -2.401900  0.737268
2022-06-27  0.862039 -0.209451 -0.068883  0.666439
2022-06-19  0.951469  0.509845 -0.462546 -1.213506

In [49]:
# sort by non-numerical values
df2.sort_values(by="F", ascending=False)

     A          B    C  D      E  F    G
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo

In [50]:
# sort by two or more columns
df2.sort_values(by=["F", "E"])

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

# Selection

For production prefer the following instead of other data access methods (typical python methods like ["col"] or [a:b] slices etc.):

```.at, .iat, .loc and .iloc.```

## Getting

In [51]:
# selecting a single column returns a Series object
df["A"]

2022-06-19    0.951469
2022-06-20   -0.439995
2022-06-21    0.107086
2022-06-22    0.644756
2022-06-23   -0.077502
2022-06-24    0.106912
2022-06-25   -0.151913
2022-06-26   -0.737959
2022-06-27    0.862039
2022-06-28   -1.324962
Freq: D, Name: A, dtype: float64

In [52]:
# selecting a slice
df[1:5]

                   A         B         C         D
2022-06-20 -0.439995  1.077854  1.328994  0.963205
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958
2022-06-22  0.644756 -0.927166 -2.401900  0.737268
2022-06-23 -0.077502 -0.119173  0.810236  1.038025

## Selection by label

In [53]:
# selecting based on a label
df.loc[dates[0]]

A    0.951469
B    0.509845
C   -0.462546
D   -1.213506
Name: 2022-06-19 00:00:00, dtype: float64

In [54]:
# select on a multi-axis by lable
# I honestly do not know what the comment above means...help!
df.loc[:, ["A", "B"]]

                   A         B
2022-06-19  0.951469  0.509845
2022-06-20 -0.439995  1.077854
2022-06-21  0.107086 -1.869701
2022-06-22  0.644756 -0.927166
2022-06-23 -0.077502 -0.119173
2022-06-24  0.106912 -2.049418
2022-06-25 -0.151913  0.425990
2022-06-26 -0.737959 -0.217128
2022-06-27  0.862039 -0.209451
2022-06-28 -1.324962 -0.528841

In [55]:
# specific index value results in reduction of dimensions
res = df.loc["2022-06-20"]
print(res)
print("res.shape = ", res.shape, " vs. df.shape = ", df.shape)

A   -0.439995
B    1.077854
C    1.328994
D    0.963205
Name: 2022-06-20 00:00:00, dtype: float64
res.shape =  (4,)  vs. df.shape =  (10, 4)

In [56]:
# get to a specific scalar:
#
# method one
df.loc[dates[0], "A"]

0.9514691676779591

In [57]:
#
# method two (slightly faster than method one)
df.at[dates[0], "A"]

0.9514691676779591

## Selection by position

In [58]:
df.iloc[2]

A    0.107086
B   -1.869701
C   -1.478948
D   -0.230958
Name: 2022-06-21 00:00:00, dtype: float64

In [59]:
# slices - similar to NumPy / Python - [row:slice, col:slice]
df.iloc[1:5, 0:2]

                   A         B
2022-06-20 -0.439995  1.077854
2022-06-21  0.107086 -1.869701
2022-06-22  0.644756 -0.927166
2022-06-23 -0.077502 -0.119173

In [60]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
df.iloc[[0, 1, 2, 6], [0, 2]]

                   A         C
2022-06-19  0.951469 -0.462546
2022-06-20 -0.439995  1.328994
2022-06-21  0.107086 -1.478948
2022-06-25 -0.151913  1.410461

In [61]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
# change the order of columns, repeact a column
df.iloc[[0, 1, 2, 6], [2, 1, 0, 2]]

                   C         B         A         C
2022-06-19 -0.462546  0.509845  0.951469 -0.462546
2022-06-20  1.328994  1.077854 -0.439995  1.328994
2022-06-21 -1.478948 -1.869701  0.107086 -1.478948
2022-06-25  1.410461  0.425990 -0.151913  1.410461

In [62]:
# slice rows explicitly, keep all columns
df.iloc[[1, 2], :]

                   A         B         C         D
2022-06-20 -0.439995  1.077854  1.328994  0.963205
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958

In [63]:
# slice columns, keep all rows
df.iloc[:, [2, 3]]

                   C         D
2022-06-19 -0.462546 -1.213506
2022-06-20  1.328994  0.963205
2022-06-21 -1.478948 -0.230958
2022-06-22 -2.401900  0.737268
2022-06-23  0.810236  1.038025
2022-06-24  0.320690  0.549374
2022-06-25  1.410461 -2.099694
2022-06-26 -1.357031 -1.084376
2022-06-27 -0.068883  0.666439
2022-06-28 -1.014416  0.667417

In [64]:
# everything, because you can
df.iloc[:, :]

                   A         B         C         D
2022-06-19  0.951469  0.509845 -0.462546 -1.213506
2022-06-20 -0.439995  1.077854  1.328994  0.963205
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958
2022-06-22  0.644756 -0.927166 -2.401900  0.737268
2022-06-23 -0.077502 -0.119173  0.810236  1.038025
2022-06-24  0.106912 -2.049418  0.320690  0.549374
2022-06-25 -0.151913  0.425990  1.410461 -2.099694
2022-06-26 -0.737959 -0.217128 -1.357031 -1.084376
2022-06-27  0.862039 -0.209451 -0.068883  0.666439
2022-06-28 -1.324962 -0.528841 -1.014416  0.667417

In [65]:
# get to a scalar (2 methods, just like before)
#
# method one: use iloc
df.iloc[1, 2]

1.3289936330584233

In [66]:
#
# method two: use iat
df.iat[1, 2]

1.3289936330584233

## Boolean Indexing

In [67]:
# use a value found in a single col to get data
df[df["A"] > 0]

                   A         B         C         D
2022-06-19  0.951469  0.509845 -0.462546 -1.213506
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958
2022-06-22  0.644756 -0.927166 -2.401900  0.737268
2022-06-24  0.106912 -2.049418  0.320690  0.549374
2022-06-27  0.862039 -0.209451 -0.068883  0.666439

In [68]:
# boolean across the entire DF - vals that don't match go NaN
df[df > 0]

                   A         B         C         D
2022-06-19  0.951469  0.509845       NaN       NaN
2022-06-20       NaN  1.077854  1.328994  0.963205
2022-06-21  0.107086       NaN       NaN       NaN
2022-06-22  0.644756       NaN       NaN  0.737268
2022-06-23       NaN       NaN  0.810236  1.038025
2022-06-24  0.106912       NaN  0.320690  0.549374
2022-06-25       NaN  0.425990  1.410461       NaN
2022-06-26       NaN       NaN       NaN       NaN
2022-06-27  0.862039       NaN       NaN  0.666439
2022-06-28       NaN       NaN       NaN  0.667417

In [69]:
# add another column
df11 = df.copy()
df11["E"] = ["one", "two", "three", "four",
             "two", "five", "one", "two", "three", "four"]
df11

                   A         B         C         D      E
2022-06-19  0.951469  0.509845 -0.462546 -1.213506    one
2022-06-20 -0.439995  1.077854  1.328994  0.963205    two
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  three
2022-06-22  0.644756 -0.927166 -2.401900  0.737268   four
2022-06-23 -0.077502 -0.119173  0.810236  1.038025    two
2022-06-24  0.106912 -2.049418  0.320690  0.549374   five
2022-06-25 -0.151913  0.425990  1.410461 -2.099694    one
2022-06-26 -0.737959 -0.217128 -1.357031 -1.084376    two
2022-06-27  0.862039 -0.209451 -0.068883  0.666439  three
2022-06-28 -1.324962 -0.528841 -1.014416  0.667417   four

In [70]:
# the isin() query - basically the in clause
df11[df11["E"].isin(["two", "five"])]

                   A         B         C         D     E
2022-06-20 -0.439995  1.077854  1.328994  0.963205   two
2022-06-23 -0.077502 -0.119173  0.810236  1.038025   two
2022-06-24  0.106912 -2.049418  0.320690  0.549374  five
2022-06-26 -0.737959 -0.217128 -1.357031 -1.084376   two

## Setting values

In [71]:
# matching indexes auto-aligns values
s1 = pd.Series(range(11, 21), index=pd.date_range('20220619', periods=10))
s1

2022-06-19    11
2022-06-20    12
2022-06-21    13
2022-06-22    14
2022-06-23    15
2022-06-24    16
2022-06-25    17
2022-06-26    18
2022-06-27    19
2022-06-28    20
Freq: D, dtype: int64

In [72]:
df["F"] = s1
df

                   A         B         C         D   F
2022-06-19  0.951469  0.509845 -0.462546 -1.213506  11
2022-06-20 -0.439995  1.077854  1.328994  0.963205  12
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  13
2022-06-22  0.644756 -0.927166 -2.401900  0.737268  14
2022-06-23 -0.077502 -0.119173  0.810236  1.038025  15
2022-06-24  0.106912 -2.049418  0.320690  0.549374  16
2022-06-25 -0.151913  0.425990  1.410461 -2.099694  17
2022-06-26 -0.737959 -0.217128 -1.357031 -1.084376  18
2022-06-27  0.862039 -0.209451 -0.068883  0.666439  19
2022-06-28 -1.324962 -0.528841 -1.014416  0.667417  20

In [73]:
# setting values by label and position
# first let's make a quick copy
df12 = df.copy()
df12

                   A         B         C         D   F
2022-06-19  0.951469  0.509845 -0.462546 -1.213506  11
2022-06-20 -0.439995  1.077854  1.328994  0.963205  12
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  13
2022-06-22  0.644756 -0.927166 -2.401900  0.737268  14
2022-06-23 -0.077502 -0.119173  0.810236  1.038025  15
2022-06-24  0.106912 -2.049418  0.320690  0.549374  16
2022-06-25 -0.151913  0.425990  1.410461 -2.099694  17
2022-06-26 -0.737959 -0.217128 -1.357031 -1.084376  18
2022-06-27  0.862039 -0.209451 -0.068883  0.666439  19
2022-06-28 -1.324962 -0.528841 -1.014416  0.667417  20

In [74]:
# set by label
df12.at[dates[0], "A"] = 0
# set by position
df12.iat[0, 1] = 0
df12

                   A         B         C         D   F
2022-06-19  0.000000  0.000000 -0.462546 -1.213506  11
2022-06-20 -0.439995  1.077854  1.328994  0.963205  12
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  13
2022-06-22  0.644756 -0.927166 -2.401900  0.737268  14
2022-06-23 -0.077502 -0.119173  0.810236  1.038025  15
2022-06-24  0.106912 -2.049418  0.320690  0.549374  16
2022-06-25 -0.151913  0.425990  1.410461 -2.099694  17
2022-06-26 -0.737959 -0.217128 -1.357031 -1.084376  18
2022-06-27  0.862039 -0.209451 -0.068883  0.666439  19
2022-06-28 -1.324962 -0.528841 -1.014416  0.667417  20

In [75]:
# kinda bigger replacement
df12.loc[:, "D"] = np.array([5]*len(df))
df12

                   A         B         C    D   F
2022-06-19  0.000000  0.000000 -0.462546  5.0  11
2022-06-20 -0.439995  1.077854  1.328994  5.0  12
2022-06-21  0.107086 -1.869701 -1.478948  5.0  13
2022-06-22  0.644756 -0.927166 -2.401900  5.0  14
2022-06-23 -0.077502 -0.119173  0.810236  5.0  15
2022-06-24  0.106912 -2.049418  0.320690  5.0  16
2022-06-25 -0.151913  0.425990  1.410461  5.0  17
2022-06-26 -0.737959 -0.217128 -1.357031  5.0  18
2022-06-27  0.862039 -0.209451 -0.068883  5.0  19
2022-06-28 -1.324962 -0.528841 -1.014416  5.0  20

In [76]:
# setting values using a boolean selection (aka where clause)
df12[df12 > 0] = -df12
df12

                   A         B         C    D   F
2022-06-19  0.000000  0.000000 -0.462546 -5.0 -11
2022-06-20 -0.439995 -1.077854 -1.328994 -5.0 -12
2022-06-21 -0.107086 -1.869701 -1.478948 -5.0 -13
2022-06-22 -0.644756 -0.927166 -2.401900 -5.0 -14
2022-06-23 -0.077502 -0.119173 -0.810236 -5.0 -15
2022-06-24 -0.106912 -2.049418 -0.320690 -5.0 -16
2022-06-25 -0.151913 -0.425990 -1.410461 -5.0 -17
2022-06-26 -0.737959 -0.217128 -1.357031 -5.0 -18
2022-06-27 -0.862039 -0.209451 -0.068883 -5.0 -19
2022-06-28 -1.324962 -0.528841 -1.014416 -5.0 -20

# Missing Data

### _reindex_
change/add/delete index on a specified axis, returns a new dataframe

In [77]:
df13 = df.reindex(index=dates[0:4], columns=list(df.columns)+["G"])
df13

                   A         B         C         D   F   G
2022-06-19  0.951469  0.509845 -0.462546 -1.213506  11 NaN
2022-06-20 -0.439995  1.077854  1.328994  0.963205  12 NaN
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  13 NaN
2022-06-22  0.644756 -0.927166 -2.401900  0.737268  14 NaN

### handling missing data
1. _```np.nan```_
1. _```pandas.isna()```_
1. ```df.dropna()```
1. ```df.fillna()```

In [78]:
# missing data in pandas is np.nan
df13.iat[1, 0] = np.nan
df13.iloc[1:, 5] = np.random.randint(1)
df13

                   A         B         C         D   F    G
2022-06-19  0.951469  0.509845 -0.462546 -1.213506  11  NaN
2022-06-20       NaN  1.077854  1.328994  0.963205  12  0.0
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  13  0.0
2022-06-22  0.644756 -0.927166 -2.401900  0.737268  14  0.0

In [79]:
# get a boolean mask where values are NaN
df131 = pd.isna(df13)
df131

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [80]:
# or just
pd.isna(df13)

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [81]:
# the original is still there
df13

                   A         B         C         D   F    G
2022-06-19  0.951469  0.509845 -0.462546 -1.213506  11  NaN
2022-06-20       NaN  1.077854  1.328994  0.963205  12  0.0
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  13  0.0
2022-06-22  0.644756 -0.927166 -2.401900  0.737268  14  0.0

In [82]:
# we are going to drop / replace values now, let's make a couple of copies of the dataframe
df132 = df13.copy()
df132

                   A         B         C         D   F    G
2022-06-19  0.951469  0.509845 -0.462546 -1.213506  11  NaN
2022-06-20       NaN  1.077854  1.328994  0.963205  12  0.0
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  13  0.0
2022-06-22  0.644756 -0.927166 -2.401900  0.737268  14  0.0

In [83]:
# drop rows/columns that have missing data
# by default it returns a new dataframe, you may want to specify inplace=True for modifying current dataframe:
df_no_na = df132.dropna(how="any")
# how=‘any’ : If any NA values are present, drop that row or column.
# how=‘all’ : If all values are NA, drop that row or column.

In [84]:
# all rows/cols with missing data stripped
df_no_na

                   A         B         C         D   F    G
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  13  0.0
2022-06-22  0.644756 -0.927166 -2.401900  0.737268  14  0.0

In [85]:
# original still intact
df132

                   A         B         C         D   F    G
2022-06-19  0.951469  0.509845 -0.462546 -1.213506  11  NaN
2022-06-20       NaN  1.077854  1.328994  0.963205  12  0.0
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  13  0.0
2022-06-22  0.644756 -0.927166 -2.401900  0.737268  14  0.0

In [86]:
# drop missing data from original
df132.dropna(how="any", inplace=True)
df132

                   A         B         C         D   F    G
2022-06-21  0.107086 -1.869701 -1.478948 -0.230958  13  0.0
2022-06-22  0.644756 -0.927166 -2.401900  0.737268  14  0.0

In [87]:
# fill missing data
df133 = df13.copy()
df133.fillna(np.pi*1000)

                      A         B         C         D   F            G
2022-06-19     0.951469  0.509845 -0.462546 -1.213506  11  3141.592654
2022-06-20  3141.592654  1.077854  1.328994  0.963205  12     0.000000
2022-06-21     0.107086 -1.869701 -1.478948 -0.230958  13     0.000000
2022-06-22     0.644756 -0.927166 -2.401900  0.737268  14     0.000000

# Align and Join

There needs to be a bigger notebook for this topic.
You need to know there's "joins" in Pandas just like in the SQL world, 
like join and left join and right join and inner and outer and all that...
Here we'll explore these in the context of the align function - 'aligning' the indexes of two dataframes.
Later we'll see these again in the context of _merging_ two data frames.

## Create two datasets with _mismatched_ indexes

In [88]:
# date range indexes
idx1 = pd.date_range('2022-01-01',periods = 10)
# 2022-01-01', '2022-01-02' don't exist in idx2
# '2022-01-11', '2022-01-12' don't exist in idx1
idx2 = pd.date_range('2022-01-03',periods = 10)

In [89]:
# dataframes from indexes
d1 = pd.DataFrame(index = idx1, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

d2 = pd.DataFrame(index = idx2, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

## Quick Aside: Rendering two dataframes side-by-side

The trick of rendering 2 dataframes side-by-side was from [this](https://stackoverflow.com/questions/38783027/jupyter-notebook-display-two-pandas-tables-side-by-side) stackoverflow question.

In [90]:
# we gon need to display both data frames side by side, so...
from IPython.display import display_html 
def render_df_side_by_side(a, b, a_title = "", b_title = ""):
    a_styler = a.style.set_table_attributes("style='display:inline'").set_caption(a_title)
    b_styler = b.style.set_table_attributes("style='display:inline'").set_caption(b_title)
    display_html(a_styler._repr_html_()+b_styler._repr_html_(), raw=True)

In [91]:
render_df_side_by_side(d1,d2)

,A,B
2022-01-01 00:00:00,0.962470,3
2022-01-02 00:00:00,0.398679,18
2022-01-03 00:00:00,0.559279,19
2022-01-04 00:00:00,0.373105,15
2022-01-05 00:00:00,0.125091,3
2022-01-06 00:00:00,0.518255,12
2022-01-07 00:00:00,0.544124,5
2022-01-08 00:00:00,0.350458,23
2022-01-09 00:00:00,0.394983,19
2022-01-10 00:00:00,0.848783,4
,A,B
2022-01-03 00:00:00,0.264750,14
2022-01-04 00:00:00,0.616892,9
2022-01-05 00:00:00,0.179158,10
2022-01-06 00:00:00,0.837396,20
2022-01-07 00:00:00,0.237599,7
2022-01-08 00:00:00,0.975567,2
2022-01-09 00:00:00,0.184468,13
2022-01-10 00:00:00,0.584673,4
2022-01-11 00:00:00,0.203321,17
2022-01-12 00:00:00,0.879404,9

Table rendering/styling options is [a bigger discussion](https://pandas.pydata.org/pandas-docs/stable/user_guide/style.html#) to be tackled later.

## .add, .sub, .mul, .div etc.

flexible wrappers (```add, sub, mul, div, mod, pow```) to arithmetic operators: ```+, -, *, /, //, %, **```

In [92]:
# the +, -, *, /, //, %, ** operations align indexes to create a UNION of indexes
d3 = d1+d2
d4 = d1.sub(d2) #equivalent to d1-d2
d5 = d1*d2
d6 = d1.div(d2)

In [93]:
# indexs not present in the other dataframe get a NaN
d3.style.highlight_null(null_color='red')

TypeError: Styler.highlight_null() got an unexpected keyword argument 'null_color'

In [ ]:
# sub
d4.style.highlight_null(null_color='red')

In [ ]:
# mul
d5.style.highlight_null(null_color='red')

In [ ]:
# div
d6.style.highlight_null(null_color='red')

### removing the NaN values from the resultant dataframe

In [ ]:
# the + operation is UNION of indexes
d31 = d1+d2
# indexs not present in the other dataframe get a NaN
# do you can obvs remove nan values like before
d3.dropna().style.highlight_null(null_color='red')

## df.align()

Pandas [align](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.align.html) works to join the dataframes in interesting ways.

In [ ]:
# align returns two dataframes - left and right as a result of a join
# default join is outer - the union of indices will be used as index for left and right
left, right = d1.align(d2, join='outer')
render_df_side_by_side(left, right)

In [ ]:
# inner join
left, right = d1.align(d2, join='inner')
render_df_side_by_side(d1,d2)

In [ ]:
# we can fill the NaNs with a certain value if needed
# let's fill with -100 so we can see it clearly
left, right = d1.align(d2, join='outer', fill_value = -100) 
render_df_side_by_side(left, right)

In [ ]:
# left join: left index is added to right, but not the other way
left, right = d1.align(d2, join='left') 
render_df_side_by_side(left, right)

In [ ]:
# right join: right index is added to left, but not the other way
left, right = d1.align(d2, join='right') 
render_df_side_by_side(left, right)

There's more to explore in align, and it can get confusing, so beginners be careful, take time and try to work out the result before you execute to build intuition.

# Operations on data

## Stats

Operations in general *exclude* missing data

In [ ]:
# arithmetic mean, for each column (axis = 0)
df.mean()

In [ ]:
# mean across a row (axis = 1)
df.mean(1)

## Apply

In [ ]:
# apply custom lambdas
df.apply(lambda x: x.max()-x.min())

In [ ]:
df

In [ ]:
# each subsequent value is a sum of all values before it in the respective column
cumsum_df = df.apply(np.cumsum)
render_df_side_by_side(df, cumsum_df, "OG Dataframe", "Cumulative Sum")

## Histogramming

Frequencies, 'nuff said

```value_counts()```

In [ ]:
series1 = pd.Series(np.random.randint(0,5, size = 25))
series1.value_counts()

## String Methods

In [ ]:
# build a series
some_string = "SERIes and Index are EqUIppeD WITh A seT Of stRINg PROCESSING METHoDs In tHe ```sTR``` attrIBute THAT MakE IT eASy To oPerATE ON EACh ELEmeNt OF The aRrAY. NOtE thAt PAtTERN-maTching in ```sTR``` gENeralLY UsES reGUlAr eXpreSsiONs bY DEfault (aND In Some cases AlwayS uSEs tHeM)."
str_series = pd.Series(some_string.split()) # split splits on whitespace by default

In [ ]:
# manipulating the case - lower, upper etc.
# also the length of each string, split, replace, yada yada...
# very important when cleaning data (column names may have stupid whitespace, bad case, spacing etc.)
low = str_series.str.lower()
up = str_series.str.upper()

low_up_df = pd.DataFrame(
    {
        'og': str_series,
        'length': str_series.str.len(),
        'low': low,
        'up': up,
        'split_low_on_i': low.str.split('i', expand = False), # expand = True will break this usecase, try elsewhere
        'replace_a_with_star_in_low': low.str.replace('a','*', case=False, regex=True) # yeah, you can mess with regular expns
    })

low_up_df.tail(10)

See [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-string-methods) for more string operations.

# Merge

Combine series and dataframes, use set logic for indexes and relational algebra for joins/merges

## Concat

Chill, we've done this before. The same join = inner/outer/left/right drill.

In [ ]:
# let's make some more dataframes
concatDF = pd.DataFrame(np.random.randn(10,4)) # 10 rows and 4 columns of random numbers
pieces = [concatDF[:3], concatDF[3:7], concatDF[7:]]
reconstructedDF = pd.concat(pieces)
display('broken DFs: ',pieces)
render_df_side_by_side(concatDF, reconstructedDF, "OG", "Concatenated")

_From the [page](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#concat)_:
Adding a column to a DataFrame is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the DataFrame constructor instead of building a DataFrame by iteratively appending records to it.

## Join
SQL style merges.

In [ ]:
# two data frames
sl = pd.Series(np.random.randint(10, size=6))
sr = sl.shift(2).fillna(0).astype(int)
left = pd.DataFrame(
    {
        'key': list('ABCDEF'),
        'lval': sl
    }
)

right = pd.DataFrame(
    {
        'key': list('ABBCDE'),
        'rval': sr
    }
)

In [ ]:
render_df_side_by_side(left, right, 'left', 'right')

In [ ]:
result = pd.merge(left, right, on='key')
result

# Grouping

"Group By" really means one or more of the following happening:
1. **Split**: data is broken into groups based on some criteria
2. **Apply**: a data operation is executed on each of those groups
3. **Combine**: the results are combined back into a data structure

In [ ]:
grp_df = pd.DataFrame(
    {
        'colA': list('AABCAABDAA'),
        'colB': list('1234567890'),
        'colC': np.random.randn(10),
        'colD': np.random.randn(10)
    }
)
grp_df

In [ ]:
# a DataFrameGroupBy object object
grpby = grp_df.groupby('colA')

# list all the groups found
g = grpby.groups
g

In [ ]:
# to create a dataframe from the group use something like
grpby.get_group('A')

### Find all the groups

In [ ]:
# but we may not know all the groups in the dataframe.
# so got to find a way to list all groups as dataframes.
# 
# some basic python helps create a list of groupby names
grpby_labels_list = [*g.keys()] # using the unpacking operator *
# alternatively
# grpby_labels_list = list(g.keys())
grpby_labels_list

In [ ]:
# create a dict where the group label is the key and the group dataframe is the value
grps = {lbl: grpby.get_group(lbl) for lbl in grpby_labels_list}

# now use the dict to access individual dataframes created out of the groupby operation
grps['B']

# question: can we create a dataframe of dataframes?

In [ ]:
# You can see the datatype of the value is a pandas dataframe
type(grps['A'])

In [ ]:
# make a function of it all...
def get_all_groups(df_grpby):
    return {lbl: df_grpby.get_group(lbl) for lbl in list(df_grpby.groups.keys())}

In [ ]:
grps = get_all_groups(grp_df.groupby('colA'))
grps

In [ ]:
# get a sum of values from each group
grp_df.groupby('colA').sum()

In [ ]:
# let's add one more column to the dataframe
# we can try grouping on two columns
grp_df['colE'] = list('1231231231')
grp_df

In [ ]:
g2 = grp_df.groupby(['colA','colE'])
grps2 = get_all_groups(g2)
grps2

In [ ]:
render_df_side_by_side(grps2[('A','1')], grps2[('A','2')], 'A,1', 'A,2')

# Reshaping

Stacking and Pivot Tables.
This really warrants more practice, at least go through [the page](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html#)

## Stacking

In [ ]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
    )
)

If the syntax [*expression](https://docs.python.org/dev/reference/expressions.html#calls) appears in the function call, expression must evaluate to an iterable. Elements from these iterables are treated as if they were additional positional arguments.

...although the *expression syntax may appear after explicit keyword arguments, it is processed before the keyword arguments (and any **expression arguments)

In [ ]:
# starred expressions...
def f(a,b):
    print(a, ' ', b)
    
f (b=1, *(2,)) # works, the tuple (iterable) is expanded, 2 is assigned to a, then b fills the next argument slot
# f (a=1, *(2,)) # FAILS, multiple values for argument 'a'

In [ ]:
tuples

In [ ]:
stack_idx = pd.MultiIndex.from_tuples(tuples, names = ['first', 'second'])

In [ ]:
stack_df = pd.DataFrame(np.random.randn(8,2), index = stack_idx, columns = ['a','b'])
stack_df

In [ ]:
# stack really just combines the columns
stacked = stack_df.stack()
stacked

In [ ]:
# unstacked brings back the two columns
# by default unstacks the last level
unstacked = stacked.unstack()
unstacked

In [ ]:
stacked.unstack(1)

In [ ]:
stacked.unstack(0)

In [ ]:
# you can basically pivot the columns and rows using a combination of stack() and unstack()
unstacked.unstack()

## Pivot Tables

In [ ]:
# we're now just using data created in the pandas documentation - just cause, time.
pivot_tables_df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
pivot_tables_df

In [ ]:
# simple pivot tables - data, values to aggregate, index, columns to pivot along
pd.pivot_table(pivot_tables_df, values = 'D', index = ['A', 'B'], columns = ['C'])

In [ ]:
# more'n one columns of values
# mark all NaN as zero (0)
pd.pivot_table(pivot_tables_df, values = ['D', 'E'], index = ['A', 'B'], columns = ['C']).fillna(0)

# Time Series

## Resample
We may need to resample data to a different time-frequency. 
Like get data every second and resample to data every 5 minutes and so on...

In [ ]:
rng = pd.date_range('01/01/2022', periods = 1000, freq = 'S')

In [ ]:
ts = pd.Series(np.random.randint(0,500, len(rng)), index=rng)

In [ ]:
ts.resample('5min').sum()

read up on [date offset strings](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#dateoffset-objects) like '5min' etc.

## Timezones

In [ ]:
# timezone representation
rng2 = pd.date_range('01/01/2022', periods = 500, freq='D')
ts2 = pd.Series(np.random.randint(0,365, len(rng2)), index=rng2)
ts2_utc = ts2.tz_localize('UTC')

In [ ]:
# convert to US/Eastern
ts2_utc.tz_convert('US/Eastern')

## Time span representations

Converting between periods and timestamps.

Period is a _timespan_ - span of time between two timestamps.

In [ ]:
# month - end of each 
rng3 = pd.date_range('01/01/2022', periods = 12, freq='M')
rng3

In [ ]:
ts3 = pd.Series(np.random.randn(len(rng3)), index = rng3)
ts3

In [ ]:
ps = ts3.to_period()
ps

In [ ]:
ps.to_timestamp()

A more complex use-case:
convert a _quarterly frequency_ with _year ending in November_ to _9am_ of _the end of the month_ _following_ the _quarter end_

In [ ]:
prng = pd.period_range('1990Q1', '2022Q4', freq='Q-NOV')
type(prng)

In [ ]:
ts4 = pd.Series(np.random.randn(len(prng)), index=prng)
ts4.head()

In [ ]:
ts4.index = (prng.asfreq('M', 'e') +1).asfreq('H', 's')+9
ts4.head()

# Categoricals

[This page](https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html#categorical).

For e.g., gender, social class, blood type, country affiliation, observation time or rating via Likert scales.
Categorical data. Categories allow (usually) fixed number of possible values. Categorical data may have some order, but not support numerical operations (for e.g., 'strongly agree', 'agree', 'disagree', 'strongly disagree').

In [ ]:
cat_df = pd.DataFrame(
    {"id": list('123456'), "raw_grade":list('abbaae')}
)
cat_df

In [ ]:
# convert the raw_grade col to categories
cat_df['grade'] = cat_df['raw_grade'].astype('category')
cat_df

In [ ]:
# list of categories
cat_df['grade']

In [ ]:
# can give more meaningful names here
# direct assignment to Series.cat.categories()
cat_df['grade'].cat.categories = ['very good', 'meh', 'very bad']
cat_df['grade']

In [ ]:
cat_df

In [ ]:
# list of categories 
list(cat_df['grade'].cat.categories)

# categorical.CategoricalAccessor encapsulates all changes to categoricals
# for e.g., set_categories or remove_categories
# dir(cat_df['grade'].cat)

In [ ]:
# add more categories
cat_df['grade'] = cat_df['grade'].cat.set_categories(["very bad", "bad", "meh", "good", "very good"])
# new list of categories
list(cat_df['grade'].cat.categories)

In [ ]:
# now when we can sort the dataframe in order of categories (not lexical)
sorted_cat_df = cat_df.sort_values(by='grade')
render_df_side_by_side(cat_df, sorted_cat_df, 'OG', 'Sorted')

In [ ]:
# grouping
cat_grp = cat_df.groupby('grade')
cat_grp.get_group('very good')

In [ ]:
# count elements
cat_grp.size()